In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [3]:
# Create Path
path = r'/Users/chrisherin/Documents/01_Jupyter/11-2021 Instacart Basket Analysis'

In [4]:
#  Path Check
path

'/Users/chrisherin/Documents/01_Jupyter/11-2021 Instacart Basket Analysis'

In [5]:
# Import 'product' Data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [6]:
# Import Check
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
# Import 'orders' Data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [8]:
# Import Check
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [9]:
# Drop new index column from import
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [9]:
# Check
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [10]:
# Save df

df_ords.to_csv(os.path.join(path,'02 Data','Prepared Data','orders_checked.csv'))

In [11]:
# Data info
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(5)
memory usage: 156.6 MB

In [12]:
# Change 'user_id' to str
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [13]:
# Change 'order_id' to str
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [14]:
# Data info check
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 156.6+ MB

In [15]:
# Check
df_ords.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

:: I don't know how to save the dataframe with type changes. Does not save as is.

:: Ready for Exercise 4.5

In [16]:
# Create dataframe

df_test = pd.DataFrame()

In [17]:
# Create mixed type column

df_test['mixed'] = ['a','b', 1, True]

In [18]:
# Check

df_test.head()

  mixed
0     a
1     b
2     1
3  True

In [19]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mixed

In [20]:
# Change data type for 'mixed' column to str

df_test['mixed'] = df_test['mixed'].astype('str')

In [21]:
# Check

df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mixed   4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

:: Confirm - 'mixed' column changed to str

Finding Missing Values

In [22]:
# Finding missing values. Using .isnull() finds the values while .sum() adds them up. 

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [23]:
# Create new df with all missing values.

df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [24]:
# Check

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

Addressing Missing Values

:: to input mean or median values in place of missing values use code

df['column with missings'].fillna(mean value, inplace=True)

df['column with missings'].fillna(median value, inplace=True)

In [25]:
df_prods.shape

(49693, 5)

In [26]:
# Create clean dataframe, new df with non missing values

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [27]:
# Check

df_prods_clean.shape

(49677, 5)

:: Alt for dropping 'nan' - this overwrite existing df without na values

df_prods[‘product_name’].dropna(inplace = True)

Duplicates

In [41]:
# Finding duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [42]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [30]:
# Current df_prods_clean shape for reference 

df_prods_clean.shape

(49677, 5)

In [31]:
# Remove duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [32]:
# New df shape without duplicates

df_prods_clean_no_dups.shape

(49672, 5)

:: Now have new df without 'missing_values' or 'duplicates'

In [33]:
# Export new df_prods_clean_no_dups

df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data','Prepared Data','products_checked.csv'))

:: When ready convert this to code:

# Remove values greater than 100 - locate values >100 and replace with 'nan'

df_prods_clean_no_dups.loc[df_prods_clean_no_dups['prices'] >100, 'prices'] = np.nan

This will take values over $100 in the 'prices' column and replace with 'nan' reuslting in a cleaner df for analysis

TASK 4.5

2. Run the df.describe() function on your df_prods dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [34]:
# Original df_prods data check

df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

:: There appears to be a product in the store that costs $99,999.00. That better be some really good steak.

3. Check for mixed-type data in your df_ords dataframe.

In [36]:
# Changed df name to _ords for mixed type check

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

:: The df does not appear to have any mixed type columns

5. Run a check for missing values in your df_ords dataframe.

In [37]:
# Find missing values in df_ords

df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

:: In a markdown cell, report your findings and propose an explanation for any missing values you find.

:: The only column that shows missing values is 'days_since_prior_order'. This could be the result of there being no days since prior order, meaning orders were placed in the same day. This would be addressed with client.

6. Address the missing values using an appropriate method.

In [38]:
# Create df with only the missing values

df_ords_0days = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [39]:
# df Check

df_ords_0days.shape

(206209, 6)

- In a markdown cell, explain why you used your method of choice.

:: By creating a df with only this data we can further assess why those show up as missing, 'nan', or '0'. It could be that orders were placed on the same day. It could be brad new customers as there would be no prior orders, this could indicate growth. Or it could be a flaw in the data collection. The possiblilties of 'WHY' are too great to simply remove the data, thus, this new df created for analysis.

7. Run a check for duplicate values in your df_ords data.

In [43]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [44]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

- In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

:: There does not appear to be any duplicates in the 'orders' dataframe.

8. Address the duplicates using an appropriate method.

:: No duplicates to address

9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

:: df_prods has been exported at the end of the assignment work

In [45]:
# Export df_ords

df_ords.to_csv(os.path.join(path,'02 Data','Prepared Data','orders_checked.csv'))

In [46]:
# Export df_ords_0days

df_ords_0days.to_csv(os.path.join(path,'02 Data','Prepared Data','0days_between_orders.csv'))

Task Complete